#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
[0m[33mRunning plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.[0m

Preparing the remote plan...
[0m
[0m[33mTo view this run in a browser, visit:
https://app.terraform.io/app/ayesha-accenture/BookQuotes/runs/run-YaWzuNEYAPJgsYCv[0m
[0m
Waiting for the plan to start...

Terraform v1.1.9
on linux_amd64
Initializing plugins and modules...
[0m[1mrandom_pet.sg: Refreshing state... [id=immense-crayfish][0m
[0m[1maws_security_group.web-sg: Refreshing state... [id=sg-0367e0f59611f5851][0m
[0m[1maws_instance.web: Refreshing state... [id=i-0b22e83ddbee837f4][0m
[0m
[1m[36mNote:[0m[1m Objects have changed outside of Terraform[0m

[0mTerraform detected the following changes made outside of Terraform since the
last "terraform apply":

[1m  # aws_instance.web[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_instance" "web" {
        [1m[0mid[0m[0m                           = "i-0b22e83ddbee837f4"
      [32m+[0m [0m[1m[0mtags[0m[0m                         = {}
        [90m# (27 unchanged attributes hidden)[0m[0m




        [90m# (4 unchanged blocks hidden)[0m[0m
    }

[1m  # aws_security_group.web-sg[0m has changed[0m[0m
[0m  [33m~[0m[0m resource "aws_security_group" "web-sg" {
        [1m[0mid[0m[0m                     = "sg-0367e0f59611f5851"
        [1m[0mname[0m[0m                   = "immense-crayfish-sg"
      [32m+[0m [0m[1m[0mtags[0m[0m                   = {}
        [90m# (7 unchanged attributes hidden)[0m[0m
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.
[90m
─────────────────────────────────────────────────────────────────────────────[0m

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
[31m-[0m/[32m+[0m destroy and then create replacement
[0m
Terraform will perform the following actions:

[1m  # aws_instance.web[0m must be [1m[31mreplaced[0m[0m
[0m[31m-[0m/[32m+[0m[0m resource "aws_instance" "web" {
      [33m~[0m [0m[1m[0marn[0m[0m                          = "arn:aws:ec2:us-west-2:341614884717:instance/i-0b22e83ddbee837f4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0massociate_public_ip_address[0m[0m  = true [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mavailability_zone[0m[0m            = "us-west-2a" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcpu_core_count[0m[0m               = 1 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mcpu_threads_per_core[0m[0m         = 1 [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mdisable_api_termination[0m[0m      = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mebs_optimized[0m[0m                = false [90m->[0m [0m[90mnull[0m[0m
      [31m-[0m [0m[1m[0mhibernation[0m[0m                  = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0mhost_id[0m[0m                      = (known after apply)
      [33m~[0m [0m[1m[0mid[0m[0m                           = "i-0b22e83ddbee837f4" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0minstance_state[0m[0m               = "running" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_address_count[0m[0m           = 0 [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mipv6_addresses[0m[0m               = [] [33m->[0m [0m(known after apply)
      [32m+[0m [0m[1m[0mkey_name[0m[0m                     = (known after apply)
      [31m-[0m [0m[1m[0mmonitoring[0m[0m                   = false [90m->[0m [0m[90mnull[0m[0m
      [32m+[0m [0m[1m[0moutpost_arn[0m[0m                  = (known after apply)
      [32m+[0m [0m[1m[0mpassword_data[0m[0m                = (known after apply)
      [32m+[0m [0m[1m[0mplacement_group[0m[0m              = (known after apply)
      [33m~[0m [0m[1m[0mprimary_network_interface_id[0m[0m = "eni-03dda85e0af0f70f5" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_dns[0m[0m                  = "ip-172-31-47-208.us-west-2.compute.internal" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mprivate_ip[0m[0m                   = "172.31.47.208" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_dns[0m[0m                   = "ec2-54-190-187-131.us-west-2.compute.amazonaws.com" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0mpublic_ip[0m[0m                    = "54.190.187.131" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msecondary_private_ips[0m[0m        = [] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msecurity_groups[0m[0m              = [
          [31m-[0m [0m"immense-crayfish-sg",
        ] [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0msubnet_id[0m[0m                    = "subnet-09d83bc3bccea4562" [33m->[0m [0m(known after apply)
      [31m-[0m [0m[1m[0mtags[0m[0m                         = {} [90m->[0m [0m[90mnull[0m[0m
      [33m~[0m [0m[1m[0mtenancy[0m[0m                      = "default" [33m->[0m [0m(known after apply)
      [33m~[0m [0m[1m[0muser_data[0m[0m                    = "d36263b945850b1251dc22e4ed5c62aeb9e9e0f0" [33m->[0m [0m"377281b99a5658ae02dd1af326f7d0815d479a89" [31m# forces replacement[0m[0m
        [90m# (5 unchanged attributes hidden)[0m[0m

      [31m-[0m [0mcredit_specification {
          [31m-[0m [0m[1m[0mcpu_credits[0m[0m = "standard" [90m->[0m [0m[90mnull[0m[0m
        }

      [32m+[0m [0mebs_block_device {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_name[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mencrypted[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0miops[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0msnapshot_id[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mtags[0m[0m                  = (known after apply)
          [32m+[0m [0m[1m[0mthroughput[0m[0m            = (known after apply)
          [32m+[0m [0m[1m[0mvolume_id[0m[0m             = (known after apply)
          [32m+[0m [0m[1m[0mvolume_size[0m[0m           = (known after apply)
          [32m+[0m [0m[1m[0mvolume_type[0m[0m           = (known after apply)
        }

      [33m~[0m [0menclave_options {
          [33m~[0m [0m[1m[0menabled[0m[0m = false [33m->[0m [0m(known after apply)
        }

      [32m+[0m [0mephemeral_block_device {
          [32m+[0m [0m[1m[0mdevice_name[0m[0m  = (known after apply)
          [32m+[0m [0m[1m[0mno_device[0m[0m    = (known after apply)
          [32m+[0m [0m[1m[0mvirtual_name[0m[0m = (known after apply)
        }

      [33m~[0m [0mmetadata_options {
          [33m~[0m [0m[1m[0mhttp_endpoint[0m[0m               = "enabled" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhttp_put_response_hop_limit[0m[0m = 1 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mhttp_tokens[0m[0m                 = "optional" [33m->[0m [0m(known after apply)
        }

      [32m+[0m [0mnetwork_interface {
          [32m+[0m [0m[1m[0mdelete_on_termination[0m[0m = (known after apply)
          [32m+[0m [0m[1m[0mdevice_index[0m[0m          = (known after apply)
          [32m+[0m [0m[1m[0mnetwork_interface_id[0m[0m  = (known after apply)
        }

      [33m~[0m [0mroot_block_device {
          [33m~[0m [0m[1m[0mdelete_on_termination[0m[0m = true [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mdevice_name[0m[0m           = "/dev/sda1" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mencrypted[0m[0m             = false [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0miops[0m[0m                  = 100 [33m->[0m [0m(known after apply)
          [32m+[0m [0m[1m[0mkms_key_id[0m[0m            = (known after apply)
          [33m~[0m [0m[1m[0mtags[0m[0m                  = {} [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mthroughput[0m[0m            = 0 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_id[0m[0m             = "vol-0b147e4360e55c074" [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_size[0m[0m           = 8 [33m->[0m [0m(known after apply)
          [33m~[0m [0m[1m[0mvolume_type[0m[0m           = "gp2" [33m->[0m [0m(known after apply)
        }
    }

[0m[1mPlan:[0m 1 to add, 0 to change, 1 to destroy.
[0m[0m
[1mChanges to Outputs:[0m[0m
  [33m~[0m [0m[1m[0mweb-address[0m[0m = "ec2-54-190-187-131.us-west-2.compute.amazonaws.com:8080" [33m->[0m [0m(known after apply)

```

</details>

*Pushed by: @AyeshaAhmed, Action: `pull_request`*